jacobmcollier/arduino-proffieboard/system/STM32L4xx/Source/USB/usbd_cdc_msc.c
/**
  ******************************************************************************
  * @file    usbd_cdc_msc.c
  * @author  MCD Application Team
  * @version V2.4.2
  * @date    11-December-2015
  * @brief
  *           
  *  @verbatim
  *      
  *          ===================================================================      
  *                                Composite CDC_MSC
  *          =================================================================== 
  *      
  *  @endverbatim
  *                                  
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2015 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "usbd_cdc_msc.h"
#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_conf.h"
#include "usbd_ctlreq.h"
#include "usbd_webusb.h"

#include "stm32l4_gpio.h"

extern USBD_CDC_ItfTypeDef const stm32l4_usbd_cdc_interface;
extern USBD_CDC_ItfTypeDef const stm32l4_usbd_webusb_interface;
extern USBD_StorageTypeDef const dosfs_storage_interface;
extern USBD_HID_ItfTypeDef const stm32l4_usbd_dap_interface;
extern USBD_HID_ItfTypeDef const stm32l4_usbd_hid_interface;
extern void USBD_Configure(void);

extern const char *USBD_SuffixString;

/** @addtogroup STM32_USB_DEVICE_LIBRARY
  * @{
  */


/** @defgroup USBD_CDC_MSC 
  * @brief usbd core module
  * @{
  */ 

/** @defgroup USBD_CDC_MSC_Private_TypesDefinitions
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup USBD_CDC_MSC_Private_Defines
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup USBD_CDC_MSC_Private_Macros
  * @{
  */ 

/**
  * @}
  */ 


/** @defgroup USBD_CDC_MSC_Private_FunctionPrototypes
  * @{
  */


static uint8_t  USBD_CDC_MSC_Init (USBD_HandleTypeDef *pdev, 
				   uint8_t cfgidx);

static uint8_t  USBD_CDC_MSC_DeInit (USBD_HandleTypeDef *pdev, 
				     uint8_t cfgidx);

static uint8_t  USBD_CDC_MSC_Setup (USBD_HandleTypeDef *pdev, 
				    USBD_SetupReqTypedef *req);

static uint8_t  USBD_CDC_MSC_DataIn (USBD_HandleTypeDef *pdev, 
				     uint8_t epnum);

static uint8_t  USBD_CDC_MSC_DataOut (USBD_HandleTypeDef *pdev, 
				      uint8_t epnum);

static uint8_t  USBD_CDC_MSC_EP0_RxReady (USBD_HandleTypeDef *pdev);

static const uint8_t  *USBD_CDC_MSC_GetFSCfgDesc (uint16_t *length);

static const uint8_t  *USBD_CDC_MSC_GetHSCfgDesc (uint16_t *length);

static const uint8_t  *USBD_CDC_MSC_GetOtherSpeedCfgDesc (uint16_t *length);

static const uint8_t  *USBD_CDC_MSC_GetDeviceQualifierDescriptor (uint16_t *length);

/* USB Standard Device Descriptor */
static const uint8_t USBD_CDC_MSC_DeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] =
{
  USB_LEN_DEV_QUALIFIER_DESC,
  USB_DESC_TYPE_DEVICE_QUALIFIER,
  0x00,
  0x02,
  0x00,
  0x00,
  0x00,
  0x40,
  0x01,
  0x00,
};

/**
  * @}
  */ 

/** @defgroup USBD_CDC_MSC_Private_Variables
  * @{
  */ 


/* CDC_MSC interface class callbacks structure */
static const USBD_ClassTypeDef  USBD_CDC_MSC_CLASS = 
{
  USBD_CDC_MSC_Init,
  USBD_CDC_MSC_DeInit,
  USBD_CDC_MSC_Setup,
  NULL,                 /* EP0_TxSent, */
  USBD_CDC_MSC_EP0_RxReady,
  USBD_CDC_MSC_DataIn,
  USBD_CDC_MSC_DataOut,
  NULL,
  NULL,
  NULL,     
  USBD_CDC_MSC_GetHSCfgDesc,  
  USBD_CDC_MSC_GetFSCfgDesc,    
  USBD_CDC_MSC_GetOtherSpeedCfgDesc, 
  USBD_CDC_MSC_GetDeviceQualifierDescriptor,
#if (USBD_SUPPORT_USER_STRING == 1)
  USBD_CDC_MSC_GetUsrStrDescriptor,
#endif  
};

/* WEBUSB interface class callbacks structure */
static const USBD_ClassTypeDef  USBD_WEBUSB_CLASS_Interface = 
{
  USBD_WEBUSB_Init,
  USBD_WEBUSB_DeInit,
  USBD_WEBUSB_Setup,
  NULL,                 /* EP0_TxSent, */
  NULL,                 /* EP0_RxReady */
  USBD_WEBUSB_DataIn,
  USBD_WEBUSB_DataOut,
  NULL,
  NULL,
  NULL,     
  NULL,
  NULL,
  NULL,
  NULL,
#if (USBD_SUPPORT_USER_STRING == 1)
  NULL,
#endif  
};

static const USBD_ClassTypeDef  USBD_MSC_CLASS_Interface = 
{
  USBD_MSC_Init,
  USBD_MSC_DeInit,
  USBD_MSC_Setup,
  NULL,                 /* EP0_TxSent, */
  NULL,                 /* EP0_RxReady */
  USBD_MSC_DataIn,
  USBD_MSC_DataOut,
  NULL,
  NULL,
  NULL,     
  NULL,
  NULL,
  NULL,
  NULL,
#if (USBD_SUPPORT_USER_STRING == 1)
  NULL,
#endif  
};

static const USBD_ClassTypeDef  USBD_HID_CLASS_Interface = 
{
  USBD_HID_Init,
  USBD_HID_DeInit,
  USBD_HID_Setup,
  NULL,                 /* EP0_TxSent, */
  USBD_HID_EP0_RxReady, /* EP0_RxReady */
  USBD_HID_DataIn,
  USBD_HID_DataOut,
  NULL,
  NULL,
  NULL,     
  NULL,
  NULL,
  NULL,
  NULL,
#if (USBD_SUPPORT_USER_STRING == 1)
  NULL,
#endif  
};

static const USBD_ClassTypeDef * USBD_MSC_Class_Interface = NULL;
static const USBD_ClassTypeDef * USBD_HID_Class_Interface = NULL;
static const USBD_ClassTypeDef * USBD_WEBUSB_Class_Interface = NULL;

static uint16_t USBD_MSC_Interface = 0xffff;
static uint16_t USBD_HID_Interface = 0xffff;
static uint16_t USBD_WEBUSB_Interface = 0xffff;

#define USB_CDC_CONFIG_DESC_SIZ   (9+8+(9+5+5+4+5+7)+(9+7+7))
#define USB_MSC_CONFIG_DESC_SIZ   (9+7+7)
#define USB_HID_CONFIG_DESC_SIZ   (9+9+7+7)
#define USB_WEBUSB_CONFIG_DESC_SIZ   (9+7+7)

