jacobmcollier/arduino-proffieboard/system/STM32L4xx/Source/USB/usbd_cdc_msc.c
#define USB_CDC_INTERFACE_CONTROL 0
#define USB_CDC_INTERFACE_DATA    1

#define USB_CDC_INTERFACE_COUNT   2
#define USB_MSC_INTERFACE_COUNT   1
#define USB_HID_INTERFACE_COUNT   1
#define USB_WEBUSB_INTERFACE_COUNT   1

#define USB_CDC_MSC_CONFIG_DESC_SIZ      (USB_CDC_CONFIG_DESC_SIZ + USB_MSC_CONFIG_DESC_SIZ)
#define USB_CDC_HID_CONFIG_DESC_SIZ      (USB_CDC_CONFIG_DESC_SIZ + USB_HID_CONFIG_DESC_SIZ)
#define USB_CDC_MSC_HID_CONFIG_DESC_SIZ  (USB_CDC_CONFIG_DESC_SIZ + USB_MSC_CONFIG_DESC_SIZ + USB_HID_CONFIG_DESC_SIZ)
#define USB_CDC_WEBUSB_CONFIG_DESC_SIZ  (USB_CDC_CONFIG_DESC_SIZ + USB_WEBUSB_CONFIG_DESC_SIZ)
#define USB_CDC_MSC_WEBUSB_CONFIG_DESC_SIZ  (USB_CDC_CONFIG_DESC_SIZ + USB_MSC_CONFIG_DESC_SIZ + USB_WEBUSB_CONFIG_DESC_SIZ)

#define USB_CDC_MSC_INTERFACE_COUNT      (USB_CDC_INTERFACE_COUNT + USB_MSC_INTERFACE_COUNT)
#define USB_CDC_HID_INTERFACE_COUNT      (USB_CDC_INTERFACE_COUNT + USB_HID_INTERFACE_COUNT)
#define USB_CDC_MSC_HID_INTERFACE_COUNT  (USB_CDC_INTERFACE_COUNT + USB_MSC_INTERFACE_COUNT + USB_HID_INTERFACE_COUNT)
#define USB_CDC_WEBUSB_INTERFACE_COUNT  (USB_CDC_INTERFACE_COUNT + USB_WEBUSB_INTERFACE_COUNT)
#define USB_CDC_MSC_WEBUSB_INTERFACE_COUNT  (USB_CDC_INTERFACE_COUNT + USB_MSC_INTERFACE_COUNT + USB_WEBUSB_INTERFACE_COUNT)


#define USB_WORD(X) LOBYTE(X), HIBYTE(X)
#define USB_ENDPOINT(EP, ATTR, MAX_PACKET_SIZE, INTERVAL)		\
  0x07,                                                        /* bLength */ \
  0x05,                                                        /* bDescriptorType */ \
  EP,                                                          /* bEndpointAddress */ \
  ATTR,                                                        /* bmAttributes */ \
  USB_WORD(MAX_PACKET_SIZE),                                   /* wMaxPacketSize */ \
  INTERVAL                                                     /* bInterval */

#define USB_INTERFACE(INTERFACE_NUMBER, NUM_ENDPOINTS, INTERFACE_CLASS, INTERFACE_SUBCLASS, INTERFACE_PROTOCOL, iINTERFACE) \
  0x09,                                                        /* bLength */ \
  0x04,                                                        /* bDescriptorType */ \
  INTERFACE_NUMBER,                                            /* bInterfaceNumber */ \
  0x00,                                                        /* bAlternateSetting */ \
  NUM_ENDPOINTS,                                               /* bNumEndpoints */ \
  INTERFACE_CLASS,                                             /* bInterfaceClass */ \
  INTERFACE_SUBCLASS,                                          /* bInterfaceSubClass */	\
  INTERFACE_PROTOCOL,                                          /* bInterfaceProtocol */	\
  iINTERFACE                                                   /* iInterface */


#define CDC_CONTROL_INTERFACE_DATA(INTERFACE_NUM)			\
  /**** CDC Control Interface ****/					\
  USB_INTERFACE(INTERFACE_NUM, 0x01,  0x02,0x02,0x01, 0x05),		\
									\
  /**** CDC Header ****/						\
  0x05,                                                        /* bLength */ \
  0x24,                                                        /* bDescriptorType */ \
  0x00,                                                        /* bDescriptorSubtype */	\
  0x10,                                                        /* bcdCDC */ \
  0x01,									\
									\
  /**** CDC Call Management ****/					\
  0x05,                                                        /* bFunctionLength */ \
  0x24,                                                        /* bDescriptorType */ \
  0x01,                                                        /* bDescriptorSubtype */	\
  0x00,                                                        /* bmCapabilities */ \
  0x01,                                                        /* bDataInterface */ \
									\
  /**** CDC ACM ****/							\
  0x04,                                                        /* bFunctionLength */ \
  0x24,                                                        /* bDescriptorType */ \
  0x02,                                                        /* bDescriptorSubtype */	\
  0x02,                                                        /* bmCapabilities */ \
									\
  /**** CDC Union ****/							\
  0x05,                                                        /* bFunctionLength */ \
  0x24,                                                        /* bDescriptorType */ \
  0x06,                                                        /* bDescriptorSubtype */	\
  0x00,                                                        /* bMasterInterface */ \
  0x01,                                                        /* bSlaveInterface0 */ \
									\
  /**** CDC Control Endpoint Descriptor ****/				\
  USB_ENDPOINT(CDC_CMD_EP, 0x03, CDC_CMD_PACKET_SIZE, 0xff)


#define CDC_DATA_INTERFACE_DATA(INTERFACE_NUM)				\
  /**** CDC Data Interface ****/					\
  USB_INTERFACE(INTERFACE_NUM, 0x02,  0x0a,0x00,0x00,  0x06),		\
									\
  /**** CDC Data Endpoint IN ****/					\
  USB_ENDPOINT(CDC_IN_EP, 0x02, CDC_DATA_FS_MAX_PACKET_SIZE, 0x00),	\
									\
  /**** CDC Data Endpoint OUT ****/					\
  USB_ENDPOINT(CDC_OUT_EP, 0x02, CDC_DATA_FS_MAX_PACKET_SIZE, 0x00)

#define MSC_INTERFACE_DATA(INTERFACE_NUM)				\
  /**** MSC Interface ****/					\
  USB_INTERFACE(INTERFACE_NUM, 0x02, 0x08,0x06,0x50, 0x07),	\
								\
  /**** MSC Endpoint IN ****/					\
  USB_ENDPOINT(MSC_EPIN_ADDR, 0x02, MSC_MAX_FS_PACKET, 0x00),	\
								\
  /**** MSC Endpoint OUT ****/					\
  USB_ENDPOINT(MSC_EPOUT_ADDR, 0x02, MSC_MAX_FS_PACKET, 0x00)

#define HID_INTERFACE_DATA(INTERFACE_NUM)				\
  /**** HID Interface ****/						\
  USB_INTERFACE(0x02, 0x02, 0x03,0x00,0x00, 0x09),			\
									\
  /**** HID Descriptor ****/						\
  0x09,                                                        /* bLength */ \
  0x21,                                                        /* bDescriptorType */ \
  0x11,                                                        /* bcdHID */ \
  0x01,									\
  0x00,                                                        /* bCountryCode */ \
  0x01,                                                        /* bNumDescriptors */ \
  0x22,                                                        /* bDescriptorType */ \
  USB_WORD(USB_HID_REPORT_DESC_SIZ),                             /* wItemLength */ \
									\
  /**** HID Endpoint IN ****/						\
  USB_ENDPOINT(HID_EPIN_ADDR, 0x03, HID_EPIN_SIZE, 0x01),		\
									\
  /**** HID Endpoint OUT ****/						\
    USB_ENDPOINT(HID_EPOUT_ADDR, 0x03, HID_EPOUT_SIZE, 0x01)

#define WEBUSB_INTERFACE_DATA(INTERFACE_NUM)				\
  /**** CDC Data Interface ****/					\
  USB_INTERFACE(INTERFACE_NUM, 0x02,  0xff,0x00,0x00,  0x06),		\
									\
  /**** CDC Data Endpoint IN ****/					\
  USB_ENDPOINT(WEBUSB_IN_EP, 0x02, CDC_DATA_FS_MAX_PACKET_SIZE, 0x00),		\
									\
  /**** CDC Data Endpoint OUT ****/					\
  USB_ENDPOINT(WEBUSB_OUT_EP, 0x02, CDC_DATA_FS_MAX_PACKET_SIZE, 0x00)


