jacobmcollier/arduino-proffieboard/system/STM32L4xx/Source/USB/usbd_cdc_msc.c
#define CDC_INTERFACES_DATA(INTERFACE_NUM)				\
  /**** IAD to associate the two CDC interfaces ****/			\
  0x08,                                                        /* bLength */ \
  0x0b,                                                        /* bDescriptorType */ \
  0x00,                                                        /* bFirstInterface */ \
  0x02,                                                        /* bInterfaceCount */ \
  0x02,                                                        /* bFunctionClass */ \
  0x02,                                                        /* bFunctionSubClass */ \
  0x01,                                                        /* bFunctionProtocol */ \
  0x04,                                                        /* iFunction */ \
									\
  CDC_CONTROL_INTERFACE_DATA(INTERFACE_NUM),				\
  CDC_DATA_INTERFACE_DATA(INTERFACE_NUM + 1)

#define CONFIG_DESCRIPTOR_DATA(SIZE, INTERFACES)			\
  /**** Configuration Descriptor ****/					\
  0x09,                                                        /* bLength */ \
  0x02,                                                        /* bDescriptorType */ \
  USB_WORD(SIZE),                                              /* wTotalLength */ \
  INTERFACES,                                                  /* bNumInterfaces */ \
  0x01,                                                        /* bConfigurationValue */ \
  0x00,                                                        /* iConfiguration */ \
  0x80,                                                        /* bmAttributes */ \
  0x32                                                         /* bMaxPower */


static const uint8_t USBD_CDC_MSC_ConigurationDescriptor_1[USB_CDC_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_CONFIG_DESC_SIZ, 2),
  CDC_INTERFACES_DATA(0),
};

static const uint8_t USBD_CDC_MSC_ConigurationDescriptor_2[USB_CDC_MSC_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_MSC_CONFIG_DESC_SIZ, 3),
  CDC_INTERFACES_DATA(0),
  MSC_INTERFACE_DATA(2),
};

#define USB_HID_REPORT_DESC_SIZ 101

static const uint8_t USBD_HID_ReportDescriptor[USB_HID_REPORT_DESC_SIZ] = 
{
  //	Mouse
  0x05, 0x01,                    // USAGE_PAGE (Generic Desktop)	// 54
  0x09, 0x02,                    // USAGE (Mouse)
  0xa1, 0x01,                    // COLLECTION (Application)
  0x09, 0x01,                    //   USAGE (Pointer)
  0xa1, 0x00,                    //   COLLECTION (Physical)
  0x85, 0x01,                    //     REPORT_ID (1)
  0x05, 0x09,                    //     USAGE_PAGE (Button)
  0x19, 0x01,                    //     USAGE_MINIMUM (Button 1)
  0x29, 0x03,                    //     USAGE_MAXIMUM (Button 3)
  0x15, 0x00,                    //     LOGICAL_MINIMUM (0)
  0x25, 0x01,                    //     LOGICAL_MAXIMUM (1)
  0x95, 0x03,                    //     REPORT_COUNT (3)
  0x75, 0x01,                    //     REPORT_SIZE (1)
  0x81, 0x02,                    //     INPUT (Data,Var,Abs)
  0x95, 0x01,                    //     REPORT_COUNT (1)
  0x75, 0x05,                    //     REPORT_SIZE (5)
  0x81, 0x03,                    //     INPUT (Cnst,Var,Abs)
  0x05, 0x01,                    //     USAGE_PAGE (Generic Desktop)
  0x09, 0x30,                    //     USAGE (X)
  0x09, 0x31,                    //     USAGE (Y)
  0x09, 0x38,                    //     USAGE (Wheel)
  0x15, 0x81,                    //     LOGICAL_MINIMUM (-127)
  0x25, 0x7f,                    //     LOGICAL_MAXIMUM (127)
  0x75, 0x08,                    //     REPORT_SIZE (8)
  0x95, 0x03,                    //     REPORT_COUNT (3)
  0x81, 0x06,                    //     INPUT (Data,Var,Rel)
  0xc0,                          //   END_COLLECTION
  0xc0,                          // END_COLLECTION

  //	Keyboard
  0x05, 0x01,                    // USAGE_PAGE (Generic Desktop)	// 47
  0x09, 0x06,                    // USAGE (Keyboard)
  0xa1, 0x01,                    // COLLECTION (Application)
  0x85, 0x02,                    //   REPORT_ID (2)
  0x05, 0x07,                    //   USAGE_PAGE (Keyboard)
  0x19, 0xe0,                    //   USAGE_MINIMUM (Keyboard LeftControl)
  0x29, 0xe7,                    //   USAGE_MAXIMUM (Keyboard Right GUI)
  0x15, 0x00,                    //   LOGICAL_MINIMUM (0)
  0x25, 0x01,                    //   LOGICAL_MAXIMUM (1)
  0x75, 0x01,                    //   REPORT_SIZE (1)
  0x95, 0x08,                    //   REPORT_COUNT (8)
  0x81, 0x02,                    //   INPUT (Data,Var,Abs)
  0x95, 0x01,                    //   REPORT_COUNT (1)
  0x75, 0x08,                    //   REPORT_SIZE (8)
  0x81, 0x03,                    //   INPUT (Cnst,Var,Abs)
  0x95, 0x06,                    //   REPORT_COUNT (6)
  0x75, 0x08,                    //   REPORT_SIZE (8)
  0x15, 0x00,                    //   LOGICAL_MINIMUM (0)
  0x25, 0x65,                    //   LOGICAL_MAXIMUM (101)
  0x05, 0x07,                    //   USAGE_PAGE (Keyboard)
  0x19, 0x00,                    //   USAGE_MINIMUM (Reserved (no event indicated))
  0x29, 0x65,                    //   USAGE_MAXIMUM (Keyboard Application)
  0x81, 0x00,                    //   INPUT (Data,Ary,Abs)
  0xc0,                          // END_COLLECTION
};

static const uint8_t USBD_CDC_MSC_ConigurationDescriptor_3[USB_CDC_HID_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_HID_CONFIG_DESC_SIZ, 3),
  CDC_INTERFACES_DATA(0),
  HID_INTERFACE_DATA(2),
};

static const uint8_t USBD_CDC_MSC_ConigurationDescriptor_4[USB_CDC_MSC_HID_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_MSC_HID_CONFIG_DESC_SIZ, 4),
  CDC_INTERFACES_DATA(0),
  MSC_INTERFACE_DATA(2),
  HID_INTERFACE_DATA(3),
};

#define USB_DAP_REPORT_DESC_SIZ 28

static const uint8_t USBD_DAP_ReportDescriptor[USB_DAP_REPORT_DESC_SIZ] = 
{
  0x06, 0xc0, 0xff,                                            /* Usage Page */
  0x0a, 0x00, 0x0c,                                            /* Usage */
  0xa1, 0x01,                                                  /* Collection (Application) */
  0x75, 0x08,                                                  /* Report Size (8) */
  0x15, 0x00,                                                  /* Logical Minimum (0) */
  0x26, 0xff, 0x00,                                            /* Logical Maximum (255) */
  0x95, 0x40,                                                  /* Report Count (64) */
  0x09, 0x01,                                                  /* Usage (Vendor-Defined 1) */
  0x81, 0x02,                                                  /* Input (Data,Var,Abs,NWrp,Lin,Pref,NNul,Bit) */
  0x95, 0x40,                                                  /* Report Count (64) */
  0x09, 0x02,                                                  /* Usage (Vendor-Defined 2) */
  0x91, 0x02,                                                  /* Output (Data,Var,Abs,NWrp,Lin,Pref,NNul,NVol,Bit) */
  0xc0,                                                        /* End Collection */
};

static const uint8_t USBD_CDC_MSC_ConigurationDescriptor_5[USB_CDC_HID_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_HID_CONFIG_DESC_SIZ, 3),
  CDC_INTERFACES_DATA(0),
  HID_INTERFACE_DATA(2),
};

