jacobmcollier/arduino-proffieboard/system/STM32L4xx/Source/USB/usbd_cdc_msc.c
static const uint8_t USBD_CDC_MSC_ConigurationDescriptor_6[USB_CDC_MSC_HID_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_MSC_HID_CONFIG_DESC_SIZ, 4),
  CDC_INTERFACES_DATA(0),
  MSC_INTERFACE_DATA(2),
  HID_INTERFACE_DATA(3),
};

static const uint8_t USBD_CDC_WEBUSB_ConigurationDescriptor_7[USB_CDC_WEBUSB_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_WEBUSB_CONFIG_DESC_SIZ, 3),
  CDC_INTERFACES_DATA(0),
  WEBUSB_INTERFACE_DATA(2),
};

static const uint8_t USBD_CDC_MSC_WEBUSB_ConigurationDescriptor_8[USB_CDC_MSC_WEBUSB_CONFIG_DESC_SIZ] =
{
  CONFIG_DESCRIPTOR_DATA(USB_CDC_MSC_WEBUSB_CONFIG_DESC_SIZ, 4),
  CDC_INTERFACES_DATA(0),
  MSC_INTERFACE_DATA(2),
  WEBUSB_INTERFACE_DATA(3),
};

static const uint8_t * USBD_CDC_MSC_ConigurationDescriptorData = NULL;
static uint16_t USBD_CDC_MSC_ConigurationDescriptorLength = 0;

/**
  * @}
  */ 

/** @defgroup USBD_CDC_MSC_Private_Functions
  * @{
  */ 

/**
  * @brief  USBD_CDC_MSC_Init
  *         Initialize the CDC & MSC interfaces
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t  USBD_CDC_MSC_Init (USBD_HandleTypeDef *pdev, 
				  uint8_t cfgidx)
{
  USBD_Configure();

  USBD_CDC_Init(pdev, cfgidx);

  if (USBD_MSC_Class_Interface) (*USBD_MSC_Class_Interface->Init)(pdev, cfgidx);
  if (USBD_HID_Class_Interface) (*USBD_HID_Class_Interface->Init)(pdev, cfgidx);
  if (USBD_WEBUSB_Class_Interface) (*USBD_WEBUSB_Class_Interface->Init)(pdev, cfgidx);
    
  return USBD_OK;
}

/**
  * @brief  USBD_CDC_MSC_DeInit
  *         DeInitialize the CDC & MSC layers
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t  USBD_CDC_MSC_DeInit (USBD_HandleTypeDef *pdev, 
				     uint8_t cfgidx)
{
  if (USBD_HID_Class_Interface) (*USBD_HID_Class_Interface->DeInit)(pdev, cfgidx);
  if (USBD_MSC_Class_Interface) (*USBD_MSC_Class_Interface->DeInit)(pdev, cfgidx);
  if (USBD_WEBUSB_Class_Interface) (*USBD_WEBUSB_Class_Interface->DeInit)(pdev, cfgidx);

  USBD_CDC_DeInit(pdev, cfgidx);
    
  return USBD_OK;
}

/**
  * @brief  USBD_CDC_MSC_Setup
  *         Handle the CDC & MSC specific requests
  * @param  pdev: instance
  * @param  req: usb requests
  * @retval status
  */
static uint8_t  USBD_CDC_MSC_Setup (USBD_HandleTypeDef *pdev, 
				    USBD_SetupReqTypedef *req)
{
  switch (req->bmRequest & USB_REQ_RECIPIENT_MASK)
    {
    case USB_REQ_RECIPIENT_INTERFACE:
      if (req->wIndex == USBD_HID_Interface)
	{
	  if (USBD_HID_Class_Interface) {
	    return (*USBD_HID_Class_Interface->Setup)(pdev, req);
	  }
	}
      else if (req->wIndex == USBD_MSC_Interface)
	{
	  if (USBD_MSC_Class_Interface) {
	    return (*USBD_MSC_Class_Interface->Setup)(pdev, req);
	  }
	}
      else if (req->wIndex == USBD_WEBUSB_Interface)
	{
	  if (USBD_WEBUSB_Class_Interface) {
	    return (*USBD_WEBUSB_Class_Interface->Setup)(pdev, req);
	  }
	}
      else
	{
	  return (USBD_CDC_Setup(pdev, req));
	}
    
    case USB_REQ_RECIPIENT_ENDPOINT:
      if ((req->wIndex == HID_EPIN_ADDR) || (req->wIndex == HID_EPOUT_ADDR))
	{
	  if (USBD_HID_Class_Interface) {
	    return (*USBD_HID_Class_Interface->Setup)(pdev, req);
	  }
	}
      else if ((req->wIndex == MSC_EPIN_ADDR) || (req->wIndex == MSC_EPOUT_ADDR))
	{
	  if (USBD_MSC_Class_Interface) {
	    return (*USBD_MSC_Class_Interface->Setup)(pdev, req);
	  }
	}
      else if ((req->wIndex == WEBUSB_IN_EP) || (req->wIndex == WEBUSB_OUT_EP))
	{
	  if (USBD_WEBUSB_Class_Interface) {
	    return (*USBD_WEBUSB_Class_Interface->Setup)(pdev, req);
	  }
	}
      else
	{
	  return (USBD_CDC_Setup(pdev, req));
	}
    }   
  return USBD_OK;
}

/**
  * @brief  USBD_CDC_MSC_DataIn
  *         Data sent on non-control IN endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t  USBD_CDC_MSC_DataIn (USBD_HandleTypeDef *pdev, uint8_t epnum)
{
  if (epnum == (HID_EPIN_ADDR&~0x80))
    {
      return (*USBD_HID_Class_Interface->DataIn)(pdev, epnum);
    }
  else if (epnum == (MSC_EPIN_ADDR&~0x80))
    {
      return (*USBD_MSC_Class_Interface->DataIn)(pdev, epnum);
    }
  else if (epnum == (WEBUSB_IN_EP&~0x80))
    {
      return (*USBD_WEBUSB_Class_Interface->DataIn)(pdev, epnum);
    }
  else
    {
      return (USBD_CDC_DataIn(pdev, epnum));
    }
}

/**
  * @brief  USBD_CDC_MSC_DataOut
  *         Data received on non-control Out endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t  USBD_CDC_MSC_DataOut (USBD_HandleTypeDef *pdev, uint8_t epnum)
{      
  if (epnum == (HID_EPOUT_ADDR&~0x80))
    {
      return (*USBD_HID_Class_Interface->DataOut)(pdev, epnum);
    }
  else if (epnum == (MSC_EPOUT_ADDR&~0x80))
    {
      return (*USBD_MSC_Class_Interface->DataOut)(pdev, epnum);
    }
  else if (epnum == (WEBUSB_OUT_EP&~0x80))
    {
      return (*USBD_WEBUSB_Class_Interface->DataOut)(pdev, epnum);
    }
  else
    {
      return (USBD_CDC_DataOut(pdev, epnum));
    }
}



/**
  * @brief  USBD_CDC_MSC_EP0_RxReady
  *         Data received on non-control Out endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t  USBD_CDC_MSC_EP0_RxReady (USBD_HandleTypeDef *pdev)
{ 
  if (USBD_HID_Class_Interface) {
      (*USBD_HID_Class_Interface->EP0_RxReady)(pdev);
  }

  USBD_CDC_EP0_RxReady(pdev);

  return USBD_OK;
}

/**
  * @brief  USBD_CDC_MSC_GetFSCfgDesc 
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static const uint8_t  *USBD_CDC_MSC_GetFSCfgDesc (uint16_t *length)
{
  *length = USBD_CDC_MSC_ConigurationDescriptorLength;
  return USBD_CDC_MSC_ConigurationDescriptorData;
}

/**
  * @brief  USBD_CDC_MSC_GetHSCfgDesc 
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static const uint8_t  *USBD_CDC_MSC_GetHSCfgDesc (uint16_t *length)
{
  *length = 0;
  return NULL;
}

/**
  * @brief  USBD_CDC_MSC_GetCfgDesc 
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static const uint8_t  *USBD_CDC_MSC_GetOtherSpeedCfgDesc (uint16_t *length)
{
  *length = 0;
  return NULL;
}

/**
* @brief  DeviceQualifierDescriptor 
*         return Device Qualifier descriptor
* @param  length : pointer data length
* @retval pointer to descriptor buffer
*/
static const uint8_t  *USBD_CDC_MSC_GetDeviceQualifierDescriptor (uint16_t *length)
{
  *length = sizeof(USBD_CDC_MSC_DeviceQualifierDesc);
  return USBD_CDC_MSC_DeviceQualifierDesc;
}

