jacobmcollier/arduino-proffieboard/system/STM32L4xx/Source/USB/usbd_cdc_msc.c
void USBD_CDC_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_ConigurationDescriptor_1);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_ConigurationDescriptor_1;

  USBD_MSC_Class_Interface = NULL;
  USBD_HID_Class_Interface = NULL;

  USBD_MSC_Interface = 0xffff;
  USBD_HID_Interface = 0xffff;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
}

void USBD_CDC_MSC_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_ConigurationDescriptor_2);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_ConigurationDescriptor_2;

  USBD_MSC_Class_Interface = &USBD_MSC_CLASS_Interface;
  USBD_HID_Class_Interface = NULL;

  USBD_MSC_Interface = 2;
  USBD_HID_Interface = 0xffff;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_MSC_RegisterStorage(pdev, &dosfs_storage_interface);
}

void USBD_CDC_HID_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_ConigurationDescriptor_3);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_ConigurationDescriptor_3;

  USBD_MSC_Class_Interface = NULL;
  USBD_HID_Class_Interface = &USBD_HID_CLASS_Interface;

  USBD_MSC_Interface = 0xffff;
  USBD_HID_Interface = 2;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_HID_RegisterInterface(pdev, &stm32l4_usbd_hid_interface, USBD_HID_ReportDescriptor, sizeof(USBD_HID_ReportDescriptor));
}

void USBD_CDC_MSC_HID_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_ConigurationDescriptor_4);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_ConigurationDescriptor_4;

  USBD_MSC_Class_Interface = &USBD_MSC_CLASS_Interface;
  USBD_HID_Class_Interface = &USBD_HID_CLASS_Interface;

  USBD_MSC_Interface = 2;
  USBD_HID_Interface = 3;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_MSC_RegisterStorage(pdev, &dosfs_storage_interface);
  USBD_HID_RegisterInterface(pdev, &stm32l4_usbd_hid_interface, USBD_HID_ReportDescriptor, sizeof(USBD_HID_ReportDescriptor));
}

void USBD_CDC_DAP_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_SuffixString = " CMSIS-DAP";

  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_ConigurationDescriptor_5);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_ConigurationDescriptor_5;

  USBD_MSC_Class_Interface = NULL;
  USBD_HID_Class_Interface = &USBD_HID_CLASS_Interface;

  USBD_MSC_Interface = 0xffff;
  USBD_HID_Interface = 2;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_HID_RegisterInterface(pdev, &stm32l4_usbd_dap_interface, USBD_DAP_ReportDescriptor, sizeof(USBD_DAP_ReportDescriptor));
}

void USBD_CDC_MSC_DAP_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_SuffixString = " CMSIS-DAP";

  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_ConigurationDescriptor_6);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_ConigurationDescriptor_6;

  USBD_MSC_Class_Interface = &USBD_MSC_CLASS_Interface;
  USBD_HID_Class_Interface = &USBD_HID_CLASS_Interface;

  USBD_MSC_Interface = 2;
  USBD_HID_Interface = 3;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_MSC_RegisterStorage(pdev, &dosfs_storage_interface);
  USBD_HID_RegisterInterface(pdev, &stm32l4_usbd_dap_interface, USBD_DAP_ReportDescriptor, sizeof(USBD_DAP_ReportDescriptor));
}

void USBD_CDC_WEBUSB_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_WEBUSB_ConigurationDescriptor_7);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_WEBUSB_ConigurationDescriptor_7;

  USBD_WEBUSB_Class_Interface = &USBD_WEBUSB_CLASS_Interface;
  USBD_WEBUSB_Interface = 2;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_WEBUSB_RegisterInterface(pdev, &stm32l4_usbd_webusb_interface);
}

void USBD_CDC_MSC_WEBUSB_Initialize(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_MSC_ConigurationDescriptorLength = sizeof(USBD_CDC_MSC_WEBUSB_ConigurationDescriptor_8);
  USBD_CDC_MSC_ConigurationDescriptorData = USBD_CDC_MSC_WEBUSB_ConigurationDescriptor_8;

  USBD_MSC_Class_Interface = &USBD_MSC_CLASS_Interface;
  USBD_WEBUSB_Class_Interface = &USBD_WEBUSB_CLASS_Interface;

  USBD_MSC_Interface = 2;
  USBD_WEBUSB_Interface = 3;

  USBD_RegisterClass(pdev, &USBD_CDC_MSC_CLASS);
  USBD_CDC_RegisterInterface(pdev, &stm32l4_usbd_cdc_interface);
  USBD_MSC_RegisterStorage(pdev, &dosfs_storage_interface);
  USBD_WEBUSB_RegisterInterface(pdev, &stm32l4_usbd_webusb_interface);
}


/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
